{
    "Proceedings of the International Conference on Machine Learning": "Proc. Int. Conf. Mach. Learn.",
    "Advances in Neural Information Processing Systems": "Adv. Neural Inf. Process. Syst.",
    "IEEE Conference on Computer Vision and Pattern Recognition (CVPR)": "IEEE Conf. Comput. Vis. Pattern Recognit. (CVPR)",
    "Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR)": "Proc. IEEE Conf. Comput. Vis. Pattern Recognit. (CVPR)",
    "International Conference on Advanced Machine Learning Technologies and Applications (AMLTA)": "Int. Conf. Adv. Mach. Learn. Technol. Appl. (AMLTA)",
    "ACM/IEEE Design Automation Conference (DAC)": "ACM/IEEE Des. Autom. Conf. (DAC)",
    "Proceedings of the Annual Design Automation Conference": "Proc. Annu. Des. Autom. Conf.",
    "International Conference on Field Programmable Logic and Applications (FPL)": "Int. Conf. Field Program. Log. Appl. (FPL)",
    "Design, Automation Test in Europe Conference Exhibition (DATE)": "Des., Autom. Test Eur. Conf. Exhib. (DATE)",
    "Mathematical Programming": "Math. Program.",
    "Proceedings of the International Conference on Computer-Aided Design": "Proc. Int. Conf. Comput.-Aided Des.",
    "IEEE/ACM International Conference on Computer-Aided Design (ICCAD)": "IEEE/ACM Int. Conf. Comput.-Aided Des. (ICCAD)",
    "IEEE International Symposium on Circuits and Systems (ISCAS)": "IEEE Int. Symp. Circuits Syst. (ISCAS)",
    "Proceedings of the International Conference on Compilers, Architecture, and Synthesis for Embedded Systems": "Proc. Int. Conf. Compil., Architect., Synth. Embed. Syst.",
    "Proceedings of the IEEE/ACM International Symposium on Low-Power Electronics and Design": "Proc. IEEE/ACM Int. Symp. Low-Power Electron. Des.",
    "Internatioal Conference on VLSI Design": "Internatioal Conf. VLSI Des.",
    "IEEE Symposium on Computer Arithmetic (ARITH)": "IEEE Symp. Comput. Arith. (ARITH)",
    "IEEE International Conference on Computer Design (ICCD)": "IEEE Int. Conf. Comput. Des. (ICCD)"
}